{
  "backend/main.mo": "Defines all core data models, IDs, and in‑canister state maps for users, bookings, payments, feedback, IVR tasks, and mobile verification.",
  "feature_evidence.json": "Lists implemented features with associated source files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains human-written summaries for various frontend files for documentation and reference.",
  "frontend/index.css": "Tailwind base/theme setup defining OKLCH color tokens and CSS variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router configuring role‑based routes and loading dashboards based on profile and Internet Identity state.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user lacks permission, offering navigation back to the dashboard.",
  "frontend/src/components/bookings/BookingStatusTimeline.tsx": "Renders a visual step timeline for booking status progression.",
  "frontend/src/components/feedback/LeaveRatingCard.tsx": "Component for submitting star ratings and comments for a booking.",
  "frontend/src/components/ivr/IvrUpdatesPanel.tsx": "Displays IVR task updates linked to a specific booking.",
  "frontend/src/components/layout/AppShell.tsx": "AppShell renders the main layout with role‑based navigation and handles logout by clearing identity and queries.",
  "frontend/src/components/verification/MobileVerificationCard.tsx": "Component for requesting and verifying mobile OTPs, showing a demo OTP and submitting verification via mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading and managing identities, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, bookings, services, verification, and other backend data using the actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light and dark theme tokens and utility classes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays booking status counts and navigation links to various admin management sections.",
  "frontend/src/pages/admin/BookingAllocationPage.tsx": "Lists unassigned bookings and allows admins to assign staff using principal IDs.",
  "frontend/src/pages/admin/IVRSettingsPage.tsx": "Provides a simple local-storage-based form to configure IVR provider settings in demo mode.",
  "frontend/src/pages/admin/IVRTasksPage.tsx": "Shows IVR call tasks and lets admins update each task’s status.",
  "frontend/src/pages/admin/ManageServicesPage.tsx": "Manages service categories and subscription plans with forms to create new entries.",
  "frontend/src/pages/admin/PaymentsPage.tsx": "Displays payment records and includes tools to record new payments and update payment statuses.",
  "frontend/src/pages/admin/SupportAndFeedbackPage.tsx": "Displays all support tickets and customer feedback using query hooks, listing entries with status, message, and rating.",
  "frontend/src/pages/admin/UsersPage.tsx": "Aggregates unique customers and staff from bookings and displays their IDs in separate panels.",
  "frontend/src/pages/customer/BookingConfirmationPage.tsx": "Shows a confirmation message and booking ID after a service is booked, with navigation links.",
  "frontend/src/pages/customer/BookingDetailsPage.tsx": "Displays detailed booking info, status timeline, IVR updates, and rating option for completed bookings.",
  "frontend/src/pages/customer/BookServicePage.tsx": "Provides a form for verified users to book a service category with address and time slot, creating a booking via mutation.",
  "frontend/src/pages/customer/CatalogPage.tsx": "Lists service categories and subscription plans, linking users to booking or subscription pages.",
  "frontend/src/pages/customer/CustomerDashboard.tsx": "Shows quick links to services, bookings, subscriptions, and support, plus a preview of upcoming bookings.",
  "frontend/src/pages/customer/MyBookingsPage.tsx": "Displays the user's bookings, separating upcoming and historical items, with navigation to booking details.",
  "frontend/src/pages/customer/SubscriptionsPage.tsx": "Shows subscription plans fetched from the backend and allows users to subscribe in demo mode.",
  "frontend/src/pages/customer/SupportPage.tsx": "Lets users submit support tickets and view their existing tickets.",
  "frontend/src/pages/shared/LoginPage.tsx": "Provides a login screen using Internet Identity authentication.",
  "frontend/src/pages/shared/ProfileSetupPage.tsx": "Allows users to complete and save their profile information, including role and mobile verification.",
  "frontend/src/pages/staff/JobDetailsPage.tsx": "Displays detailed information about a specific booking and allows assigned staff to update its status.",
  "frontend/src/pages/staff/StaffDashboard.tsx": "Shows staff their assigned jobs, today's tasks, and links to their schedule.",
  "frontend/src/pages/staff/StaffJobsPage.tsx": "Displays all bookings assigned to the logged-in staff member and links to job detail pages.",
  "frontend/src/pages/staff/StaffSchedulePage.tsx": "Shows a table of confirmed or in-progress bookings for the logged-in staff member as their schedule.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash segments, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, container settings, and enabling plugins.",
  "project_state.json": "Project metadata describing architecture, features, requirements, and image assets for a multi-module service booking platform."
}